      * Test OO COBOL features
       IDENTIFICATION DIVISION.
       CLASS-ID. PERSON.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 FIRST-NAME PIC X(20).
       01 LAST-NAME  PIC X(20).
       01 AGE        PIC 9(3).

       PROCEDURE DIVISION.

       METHOD-ID. SET-NAME.
       DATA DIVISION.
       LINKAGE SECTION.
       01 FNAME PIC X(20).
       01 LNAME PIC X(20).
       PROCEDURE DIVISION USING FNAME LNAME.
           MOVE FNAME TO FIRST-NAME.
           MOVE LNAME TO LAST-NAME.
       END METHOD SET-NAME.

       METHOD-ID. DISPLAY-INFO.
       PROCEDURE DIVISION.
           DISPLAY "Name: " FIRST-NAME " " LAST-NAME.
           DISPLAY "Age: " AGE.
       END METHOD DISPLAY-INFO.

       END CLASS PERSON.
